Revit 2027 API
ExternalResourceReference.ServerId Property
 The id of the server that Revit is expecting to provide the external resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ServerId { get; }
Public ReadOnly Property ServerId As Guid
	Get
public:
property Guid ServerId {
	Guid get ();
}
member ServerId : Guid with get
Property Value
Guid
See Also
Reference
ExternalResourceReference Class
Autodesk.Revit.DB Namespace